---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IFCRange Properties
IFCRange Class See Also Send Feedback
---

The IFCRange type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | End | The ending value of the range. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Start | The starting value of the range. |

# See Also

IFCRange Class

Autodesk.Revit.DB.IFC Namespace